Repository: pypi-data/pypi-mirror-378
Catalog: packages/trytoncommunity-web-shop-woocommerce/trytoncommunity_web_shop_woocommerce-7.0.4.tar.gz/trytoncommunity_web_shop_woocommerce-7.0.4/locale/*.po
Languages: es

# field:product.category,woocommerce_tax_class:
source: WooCommerce Tax Class
es: Classe Impuesto WooCommerce

# field:web.shop,price_list:
source: Price List
es: Tarifa

# field:web.shop,shipping_product:
source: Shipping Product
es: Producto transporte

# field:web.shop,woocommerce_consumer_key:
source: WooCommerce Consumer Key
es: Clave consumidor WooCommerce

# field:web.shop,woocommerce_consumer_secret:
source: WooCommerce Consumer Secret
es: Secreto consumidor WooCommerce

# field:web.shop,woocommerce_url:
source: WooCommerce URL
es: URL WooCommerce

# field:web.shop.woocommerce_id,record:
source: Record
es: Registro

# field:web.shop.woocommerce_id,shop:
source: Web Shop
es: Tienda Web

# model:ir.message,text:msg_id_record_unique
source: The WooCommerce ID must be unique for each record and shop.
es: El ID de WooCommerce debe ser único por registro y tienda.

# model:ir.message,text:msg_missing_parents_error
source: In order to sincronize "%(records)s" you must also sincronize it's parent records.
es: Para sincronizar los registros "%(records)s" debeis sincronizar también sus registros padre.

# model:ir.message,text:msg_missing_shipping_product
source: It is not possible to import orders because shop "%(shop)s" does not have any shipping product.
es: No se puede importar los pedidos porqué la tienda "%(shop)s" no tiene producto para el transporte.

# model:ir.message,text:msg_sincronization_error
source: Error while sincronizing woocommerce records: "%(response)s".
es: Error al sincronizar los registros de woocommernce: %(response)s".

# model:ir.message,text:msg_woocommerce_id
source: WooCoomerce ID
es: ID WooCommerce

# model:web.shop.woocommerce_id,name:
source: Web Shop WooCommerce ID
es: Tienda Web ID WooCommerce

# selection:ir.cron,method:
source: Download WooCommerce Orders
es: Descargar pedidos WooCommerce

# selection:ir.cron,method:
source: Update WooCommerce Products
es: Actualizar productos WooCommerce
