Repository: pypi-data/pypi-mirror-378
Catalog: packages/horizon/horizon-25.5.1.tar.gz/horizon-25.5.1/doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: The OpenStack Dashboard is a web-based interface that allows you to manage OpenStack resources and services. The Dashboard allows you to interact with the OpenStack Compute cloud controller using the OpenStack APIs. For more information about installing and configuring the Dashboard, see the :doc:`/install/index` for your operating system.
ru: Панель управления OpenStack — это веб-интерфейс, позволяющий управлять ресурсами и службами OpenStack. Панель позволяет взаимодействовать с вычислительнным контроллером облака OpenStack с помощью API OpenStack. Для получения дополнительной информации об установке и настройке панели см. :doc:`/install/index` для вашей операционной системы.

source: The OpenStack Dashboard on Ubuntu installs the ``openstack-dashboard-ubuntu-theme`` package by default. If you do not want to use this theme, remove it and its dependencies:
ru: Панель управления в Ubuntu по умолчанию устанавливает пакет ``openstack-dashboard-ubuntu-theme``. Если вы не хотите использовать этот пакет, удалите его и его зависимости:

source: The biggest downside is that it places session data into storage on the user's machine and transports it over the wire. It also limits the quantity of session data that can be stored.
ru: Самый большой недостаток заключается в том, что данные сеанса помещаются в хранилище на машине пользователя и передаются по проводам. Это также ограничивает количество данных сессии, которые могут быть сохранены.

source: The dashboard does not show all possible project quotas. To view and update the quotas for a service, use its command-line client. See `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/cli-set-quotas.html>`_.
ru: В панели управления отображаются не все возможные квоты проектов. Чтобы просмотреть и обновить квоты для службы, используйте ее клиента в командной строке. См. `Руководство администратора OpenStack <https://docs.openstack.org/admin-guide/cli-set-quotas.html>`_.

source: The default quota values are displayed.
ru: Отображаются значения квот по умолчанию.

source: The encryption occurs within nova so that the data transmitted over the network is encrypted
ru: Шифрование происходит внутри службы nova, поэтому данные, передаваемые по сети, шифруются

source: The following Dashboard content can be customized to suit your needs:
ru: Следующий контент панели управления можно настроить в соответствии с вашими потребностями:

source: The following example shows this setting:
ru: Следующий пример демонстрирует эту настройку:

source: The following section on configuring the Dashboard for a secure HTTPS deployment, or a HTTP deployment, uses concrete examples to ensure the procedure is clear. The file path varies by distribution, however. If needed, you can also configure the VNC window size in the Dashboard.
ru: В следующем разделе о настройке панели управления для безопасного развертывания HTTPS или HTTP-развертывания используются конкретные примеры, чтобы процедура была понятна. Однако, путь к файлу зависит от дистрибутива. При необходимости вы также можете настроить размер окна VNC в панели управления.

source: The following sections describe the pros and cons of each option as it pertains to deploying the Dashboard.
ru: В следующих разделах описаны плюсы и минусы каждого варианта развертывания панели управления.

source: The following table describes the Compute and Block Storage service quotas:
ru: В следующей таблице описаны квоты вычислительной службы и блочного хранилища:

source: The image is queued to be uploaded. It might take several minutes before the status changes from ``Queued`` to ``Active``.
ru: Образ поставлен в очередь на загрузку. Может пройти несколько минут, прежде чем статус изменится с ``В очереди`` на ``Активный``.

source: The local memory back end is enabled as the default for Horizon solely because it has no dependencies. It is not recommended for production use, or even for serious development work.
ru: Использование внутренней памяти включено по умолчанию для Horizon только потому, что у нее нет зависимостей. Она не рекомендуется для использования в рабочих окружениях или даже для серьезной разработки.

source: The logo also acts as a hyperlink. The default behavior is to redirect to ``horizon:user_home``. To change this, add the following attribute to ``local_settings.py``:
ru: Логотип также действует как гиперссылка. Поведение по умолчанию — перенаправление на ``horizon:user_home``. Чтобы изменить это, добавьте следующий атрибут в ``local_settings.py``:

source: The new user will then appear in the list of projects displayed under the :guilabel:`Users` page of the dashboard. You can check on the **User Name**, **User ID**, **Domain name**, and the User status in this section.
ru: Новый пользователь появится в списке проектов, отображаемом на странице :guilabel:`Пользователи` панели управления. В этом разделе вы можете проверить **Имя пользователя**, **ID пользователя**, **Доменное имя** и статус пользователя.

source: The other options require that HTTPS is enabled; these options defend against cross-site scripting.
ru: Другие параметры требуют включения HTTPS; эти параметры защищают от межсайтового скриптинга.

source: The pros of this engine are that it requires no additional dependencies or infrastructure overhead, and it scales indefinitely as long as the quantity of session data being stored fits into a normal cookie.
ru: Плюсы этого механизма в том, что он не требует дополнительных зависимостей и инфраструктурных накладных расходов, а также масштабируется неограниченно долго, пока количество хранимых данных сессии помещается в обычный cookie.

source: The scheduler uses this information to make scheduling decisions. For information, see `Scheduling <https://docs.openstack.org/nova/latest/admin/configuration/schedulers.html>`__.
ru: Планировщик использует эту информацию для принятия решений о планировании. Для получения информации см. раздел `Планирование <https://docs.openstack.org/nova/latest/admin/configuration/schedulers.html>`__.

source: The service catalog configuration in the Identity service determines whether a service appears in the Dashboard. For the full listing, see :ref:`install-settings`.
ru: Конфигурация каталога служб в службе идентификации определяет, отображается ли служба в панели управления. Полный список см. в :ref:`install-settings`.

source: The table below provides a few alternatives available for creating encrypted volumes.
ru: В таблице ниже представлено несколько альтернатив, доступных для создания зашифрованных дисков.

source: This back end stores session data in a cookie, which is stored by the user's browser. The back end uses a cryptographic signing technique to ensure session data is not tampered with during transport. This is not the same as encryption; session data is still readable by an attacker.
ru: Этот бекэнд хранит данные сеанса в файле cookie, который сохраняется браузером пользователя. Чтобы гарантировать, что данные сеанса не будут подделаны во время передачи, бэкэнд использует технику криптографической подписи. Это не то же самое, что шифрование: данные сеанса все равно могут быть прочитаны злоумышленником.

source: This could be selected if a cinder plug-in supporting an encrypted back-end block storage device becomes available in the future. TLS or other network encryption would also be needed to protect data as it traverses the network
ru: Это можно будет сделать, если в будущем появится плагин для cinder, поддерживающий зашифрованное внутреннее блочное хранилище. TLS или другое сетевое шифрование также потребуется для защиты данных при прохождении через сеть

source: This example uses the ``http://openstack.example.com`` domain. Use a domain that fits your current setup.
ru: В этом примере используется домен ``http://openstack.example.com``. Используйте домен, который соответствует вашей текущей настройке.

source: This guide focuses on the ``local_settings.py`` file.
ru: В этом руководстве основное внимание уделяется файлу ``local_settings.py``.

source: To assign a host to the aggregate, click **+** for the host. The host moves from the :guilabel:`All available hosts` list to the :guilabel:`Selected hosts` list.
ru: Чтобы назначить узел в агрегат, нажмите **+** для узла. Узел переместится из списка :guilabel:`Все доступные узлы` в список :guilabel:`Выбранные узлы`.

source: To avoid a warning when you restart Apache on Ubuntu, create a ``blackhole`` directory in the Dashboard directory, as follows.
ru: Чтобы избежать предупреждения при перезапуске Apache на Ubuntu, создайте каталог ``blackhole`` в каталоге панели управления, как показано ниже.

source: To configure the MySQL database, create the dash database.
ru: Чтобы настроить базу данных MySQL, создайте базу данных dash.

source: To create a host aggregate
ru: Чтобы создать агрегат узлов

source: To create and manage images as an administrator for other users, use the following procedures.
ru: Чтобы создавать и управлять образами для других пользователей в качестве администратора, выполните следующие действия.

source: To create and manage images in specified projects as an end user, see the :doc:`upload and manage images with Dashboard in OpenStack End User Guide </user/manage-images>` and `manage images with CLI in OpenStack End User Guide <https://docs.openstack.org/glance/latest/admin/manage-images.html>`_.
ru: Чтобы создать и управлять образами в определенных проектах в качестве пользователя, см. :doc:`Загрузка и управление образами с помощью панели управления в руководстве пользователя OpenStack </user/manage-images>` и `управление образами с помощью командной строки в руководстве пользователя OpenStack <https://docs.openstack.org/glance/latest/admin/manage-images.html>`_.

source: To create and manage ports, see the :doc:`/user/create-networks` section of the OpenStack End User Guide.
ru: Информацию о создании и управлении портами см. в разделе :doc:`/user/create-networks` руководстве пользователя OpenStack.

source: To delete host aggregates, locate the host aggregate that you want to edit in the table. Click :guilabel:`More` and select :guilabel:`Delete Host Aggregate`.
ru: Чтобы удалить агрегаты узлов, найдите в таблице агрегат узлов, который вы хотите изменить. Нажмите :guilabel:`Больше` и выберите :guilabel:`Удалить агрегат узлов`.

source: To deploy the dashboard, see the :doc:`/install/index`.
ru: Чтобы развернуть панель управления, см. :doc:`/install/index`.

source: To edit host aggregates, select the host aggregate that you want to edit. Click :guilabel:`Edit Host Aggregate`.
ru: Чтобы изменить агрегаты узлов, выберите агрегат узлов, который вы хотите изменить. Нажмите :guilabel:`Изменить агрегат узла`.

source: To launch an instance from the snapshot, select the snapshot and click :guilabel:`Launch`. For information about launching instances, see the :doc:`OpenStack End User Guide </user/launch-instances>`.
ru: Чтобы запустить инстанс из снимка, выберите снимок и нажмите :guilabel:`Запустить`. Информацию о создании инстансов см. в :doc:`OpenStack End User Guide </user/launch-instances>`.

source: To launch instances with the dashboard as an end user, see the :doc:`/user/launch-instances` in the OpenStack End User Guide.
ru: Чтобы запустить инстансы с помощью панели управления в качестве конечного пользователя, см. :doc:`/user/launch-instances` в руководстве пользователя OpenStack.

source: To manage host aggregates
ru: Для управления агрегатами узлов

source: To manage hosts, locate the host aggregate that you want to edit in the table. Click :guilabel:`More` and select :guilabel:`Manage Hosts`.
ru: Чтобы управлять узлами, найдите в таблице агрегат узлов, который вы хотите изменить. Нажмите :guilabel:`Больше` и выберите :guilabel:`Управление узлами`.

source: To mitigate the performance issues of database queries, you can use the Django ``cached_db`` session back end, which utilizes both your database and caching infrastructure to perform write-through caching and efficient retrieval.
ru: Чтобы уменьшить проблемы с производительностью запросов к базе данных, вы можете использовать сессионный бэкэнд Django ``cached_db``, который использует как вашу базу данных, так и инфраструктуру кэширования для выполнения сквозного кэширования и эффективного извлечения данных.

source: To prevent system capacities from being exhausted without notification, you can set up quotas. Quotas are operational limits. For example, the number of gigabytes allowed for each project can be controlled so that cloud resources are optimized. Quotas can be enforced at both the project and the project-user level.
ru: Чтобы предотвратить исчерпание емкости системы без уведомления, можно установить квоты. Квоты - это оперативные ограничения. Например, можно контролировать количество гигабайт, разрешенных для каждого проекта, чтобы оптимизировать использование облачных ресурсов. Квоты можно устанавливать как на уровне проекта, так и на уровне пользователя проекта.

source: To reactivate a disabled user, select :guilabel:`Enable User` under the drop down menu.
ru: Чтобы включить отключенного пользователя, выберите :guilabel:`Включить пользователя` в выпадающем меню.

source: To see further information and CLI instructions, see `Create an encrypted volume type <https://docs.openstack.org/cinder/latest/configuration/block-storage/volume-encryption.html#create-an-encrypted-volume-type>`__ in the OpenStack Block Storage Configuration Guide.
ru: Дополнительную информацию и инструкции CLI см. в разделе `Создание зашифрованного типа диска <https://docs.openstack.org/cinder/latest/configuration/block-storage/volume-encryption.html#create-an-encrypted-volume-type>`__ в руководстве по настройке блочного хранилища OpenStack.

source: To view your changes, reload your Dashboard. If necessary, go back and modify your CSS file as appropriate.
ru: Чтобы просмотреть изменения, перезагрузите панель управления. При необходимости вернитесь и измените файл CSS соответствующим образом.

source: Track usage
ru: Отслеживание использования

source: Typically, you change quotas when a project needs more than ten volumes or 1 |nbsp| TB on a compute node.
ru: Обычно квоты изменяют, когда проекту требуется более десяти дисков или 1 ТБ на вычислительном узле.

source: Unique ID (integer or UUID) for the new flavor. If specifying 'auto', a UUID will be automatically generated.
ru: Уникальный ID (целое число или UUID) для нового шаблона конфигурации. Если указать 'auto', UUID будет сгенерирован автоматически.

source: Update Metadata
ru: Обновление метаданных

source: Update a project
ru: Обновление проекта

source: Update a user
ru: Обновление пользователя

source: Update images
ru: Обновление образов

source: Update project quotas
ru: Обновление проектных квот

source: Update the name of the project, enable the project, or disable the project as needed.
ru: При необходимости обновите название проекта, включите или отключите проект.

source: Upload your new images to ``/usr/share/openstack-dashboard/openstack_dashboard/static/dashboard/img/``.
ru: Загрузите новые изображения в ``/usr/share/openstack-dashboard/openstack_dashboard/static/dashboard/img/``.

source: Use the :guilabel:`Overview` category to track usage of instances for each project.
ru: Используйте категорию :guilabel:`Обзор` для отслеживания использования инстансов для каждого проекта.

source: Using the Dashboard, you can view default Compute and Block Storage quotas for new projects, as well as update quotas for existing projects.
ru: С помощью панели управления можно просмотреть стандартные квоты на вычисления и блочное хранилище для новых проектов, а также обновить квоты для существующих проектов.

source: Using the command-line interface, you can manage quotas for `the OpenStack Compute service <https://docs.openstack.org/nova/latest/admin/quotas.html>`__, `the OpenStack Block Storage service <https://docs.openstack.org/cinder/latest/cli/cli-set-quotas.html>`__, and the OpenStack Networking service (For CLI details, see `OpenStackClient CLI reference <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/quota.html>`_). Additionally, you can update Compute service quotas for project users.
ru: С помощью интерфейса командной строки можно управлять квотами для `вычислительной службы OpenStack <https://docs.openstack.org/nova/latest/admin/quotas.html>`__, `службы блочного хранилища OpenStack <https://docs.openstack.org/cinder/latest/cli/cli-set-quotas.html>`__ и сетевой службы OpenStack (подробности CLI см. в `справочнике по OpenStackClient CLI <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/quota.html>`_). Кроме того, вы можете обновить квоты вычислительной службы для пользователей проекта.

source: Using the dashboard, you can edit only the name assigned to a role.
ru: Используя панель управления, вы можете изменить только имя, назначенное роли.

source: Using this selection for aes-xts, the underlying key size would only be 128-bits*
ru: При использовании этого выбора для aes-xts размер базового ключа составит всего 128 бит*

source: View and manage quotas
ru: Просмотр и управление квотами

source: View default project quotas
ru: Просмотр квот по умолчанию для проекта

source: View services information
ru: Просмотр информации о службах

source: View the following information on these tabs:
ru: На этих вкладках можно просмотреть следующую информацию:

source: Volume gigabytes allowed for each project.
ru: Объем в гигабайтах, разрешенный для каждого проекта.

source: Volume snapshots allowed for each project.
ru: Снимки диска, разрешенные для каждого проекта.

source: Volumes
ru: Диски

source: Volumes allowed for each project.
ru: Объемы, допустимые для каждого проекта.

source: Volumes are the Block Storage devices that you attach to instances to enable persistent storage. Users can attach a volume to a running instance or detach a volume and attach it to another instance at any time. For information about using the dashboard to create and manage volumes as an end user, see the :doc:`OpenStack End User Guide </user/manage-volumes>`.
ru: Диски - это устройства блочного хранилища, которое вы подключаете к инстансам для обеспечения постоянного хранения данных. Пользователи могут прикрепить диск к работающему инстансу или отсоединить диск, и прикрепить его к другому инстансу в любое время. Информацию об использовании панели управления для создания и управления дисками в качестве пользователя см. в :doc:`OpenStack End User Guide </user/manage-volumes>`.

source: When the host aggregate is exposed as an availability zone, select the availability zone when you launch an instance.
ru: Если агрегат узлов используется как зона доступности, выберите зону доступности при запуске инстанса.

source: When the host aggregate is not exposed as an availability zone, select a flavor and its extra specs to target the host aggregate.
ru: Если агрегат узлов не отображается как зона доступности, выберите шаблон конфигурации и его дополнительные характеристики, чтобы направить агрегат узлов.

source: When you delete a volume type, volumes of that type are not deleted.
ru: При удалении типа диска, диски этого типа не удаляются.

source: When you delete an instance, the data of its attached volumes is not destroyed.
ru: При удалении инстанса данные подключенных к нему дисков не уничтожаются.

source: You can add one host to one or more aggregates. To add a host to an existing aggregate, edit the aggregate.
ru: Вы можете добавить один узел в один или несколько агрегатов. Чтобы добавить узел к существующему агрегату, отредактируйте агрегат.

source: You can also configure the Dashboard for a secure HTTPS deployment, or an HTTP deployment. The standard OpenStack installation uses a non-encrypted HTTP channel, but you can enable SSL support for the Dashboard.
ru: Вы также можете настроить панель управления для безопасного развертывания HTTPS или HTTP. Стандартная установка OpenStack использует незашифрованный HTTP-канал, но вы можете включить поддержку SSL для панели управления.

source: You can configure the Dashboard for a secured HTTPS deployment. While the standard installation uses a non-encrypted HTTP channel, you can enable SSL support for the Dashboard.
ru: Вы можете настроить панель управления для защищенного развертывания HTTPS. В то время как стандартная установка использует незашифрованный HTTP-канал, вы можете включить поддержку SSL для панели управления.

source: You can configure the Dashboard for a simple HTTP deployment. The standard installation uses a non-encrypted HTTP channel.
ru: Вы можете настроить панель управления для простого развертывания HTTP. Стандартная установка использует незашифрованный HTTP-канал.

source: You can sort the table by clicking on either the :guilabel:`Quota Name` or :guilabel:`Limit` column headers.
ru: Вы можете отсортировать таблицу, нажав на заголовки столбцов :guilabel:`Название квоты` или :guilabel:`Лимит`.

source: You can track costs per month by showing meters like number of vCPUs, disks, RAM, and uptime of all your instances.
ru: Вы можете отслеживать расходы за месяц, отображая такие показатели, как количество vCPU, дисков, оперативной памяти и uptime всех ваших инстансов.

source: You can use applications such as ``Memcached`` or ``Redis`` for external caching. These applications offer persistence and shared storage and are useful for small-scale deployments and development.
ru: Для внешнего кэширования можно использовать такие приложения, как ``Memcached`` или ``Redis``. Эти приложения обеспечивают постоянство и совместное хранение данных и полезны для небольших развертываний и разработок.

source: You cannot undo this action.
ru: Отменить действие невозможно.

source: Your new project will appear in the list of projects displayed under the :guilabel:`Projects` page of the dashboard. Projects are listed in alphabetical order, and you can check on the **Project ID**, **Domain name**, and status of the project in this section.
ru: Ваш новый проект появится в списке проектов, отображаемом на странице :guilabel:`Проекты` панели управления. Проекты перечислены в алфавитном порядке, и вы можете проверить **ID проекта**, **Доменное имя** и статус проекта в этом разделе.

source: `*` Source `NIST SP 800-38E <https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-38e.pdf>`_
ru: `*` Источник `NIST SP 800-38E <https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-38e.pdf>`_

source: aes-xts-plain64 (Recommended)
ru: aes-xts-plain64 (рекомендуется)

source: front-end (Recommended)
ru: front-end (рекомендуется)

source: luks (Recommended)
ru: luks (рекомендуется)

source: plain
ru: простой

source: vCPUs
ru: vCPU
