Repository: pypi-data/pypi-mirror-378
Catalog: packages/horizon/horizon-25.5.1.tar.gz/horizon-25.5.1/doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: **Bandwidth I/O**
ru: **Параметры ввода/вывода**

source: **CPU limits**
ru: **Ограничения CPU**

source: **Dashboard — Create Flavor**
ru: **Панель управления — создание шаблона конфигурации**

source: **Disk tuning**
ru: **Параметры диска**

source: **Encryption Options**
ru: **Параметры шифрования**

source: **Ephemeral Disk (GB)**
ru: **Временный диск (ГБ)**

source: **Example After**
ru: **Пример после**

source: **Example Before**
ru: **Пример до**

source: **Figure Dashboard — Create Image**
ru: **Панель управления — создание образа**

source: **Figure Dashboard — Instance Actions**
ru: **Панель управления — действия с инстансами**

source: **Name**
ru: **Имя**

source: **Optional metadata keys**
ru: **Опциональные ключи метаданных**

source: **Quota Descriptions**
ru: **Описание квот**:

source: **RAM (MB)**
ru: **Оперативная память (МБ)**

source: **Random-number generator**
ru: **Генератор случайных чисел**

source: **Root Disk (GB)**
ru: **Корневой диск (ГБ)**

source: **Swap Disk (MB)**
ru: **Swap диск (МБ)**

source: **Watchdog behavior**
ru: **Параметры watchdog**

source: **vCPUs**
ru: **vCPU**

source: 256 (Recommended for aes-xts-plain64 and aes-cbc-essiv)
ru: 256 (рекомендуется для aes-xts-plain64 и aes-cbc-essiv)

source: :guilabel:`Architecture`
ru: :guilabel:`Архитектура`

source: :guilabel:`Availability Zone`: The cloud provider defines the default availability zone, such as ``us-west``, ``apac-south``, or ``nova``. You can target the host aggregate, as follows:
ru: :guilabel:`Зона доступности`: облачный провайдер определяет зону доступности по умолчанию, например, ``us-west``, ``apac-south``, ``ru-east`` или ``nova``. Вы можете использовать агрегат узлов следующим образом:

source: :guilabel:`Block Storage Services`: Displays information specific to the Block Storage service. Both host and zone are listed for each service, as well as its activation status.
ru: :guilabel:`Службы блочного хранилища`: отображает информацию, относящуюся к службе блочного хранилища. Для каждой службы перечислены узел и зона, а также статус.

source: :guilabel:`Compute Services`: Displays information specific to the Compute service. Both host and zone are listed for each service, as well as its activation status.
ru: :guilabel:`Вычислительные службы`: отображает информацию, относящуюся к вычислительной службе. Для каждой службы перечислены узел и зона, а также статус.

source: :guilabel:`Copy Data`
ru: :guilabel:`Скопировать данные`

source: :guilabel:`Description`
ru: :guilabel:`Описание`

source: :guilabel:`Format`
ru: :guilabel:`Формат`

source: :guilabel:`Image File` or :guilabel:`Image Location`
ru: :guilabel:`Файл образа` или :guilabel:`Расположение образа`

source: :guilabel:`Image Source`
ru: :guilabel:`Источник образа`

source: :guilabel:`Minimum Disk (GB)`
ru: :guilabel:`Минимальный диск (ГБ)`

source: :guilabel:`Minimum RAM (MB)`
ru: :guilabel:`Минимальная оперативная память (МБ)`

source: :guilabel:`Name`
ru: :guilabel:`Имя`

source: :guilabel:`Name`: The host aggregate name.
ru: :guilabel:`Имя`: имя агрегата узлов.

source: :guilabel:`Network Agents`: Displays the network agents active within the cluster, such as L3 and DHCP agents, and the status of each agent.
ru: :guilabel:`Сетевые агенты`: отображает сетевые агенты, активные в кластере, такие как агенты L3 и DHCP, а также статус каждого агента.

source: :guilabel:`Protected`
ru: :guilabel:`Защищенный`

source: :guilabel:`Public`
ru: :guilabel:`Публичный`

source: :guilabel:`Services`: Displays the internal name and the public OpenStack name for each service, the host on which the service runs, and whether or not the service is enabled.
ru: :guilabel:``Службы``: отображает внутреннее имя и публичное имя OpenStack для каждой службы, узел, на котором работает служба, а также информацию о том, включена ли служба.

source: A message indicates whether the action succeeded.
ru: В сообщении указывается, удалось ли выполнить действие.

source: A role is a personality that a user assumes to perform a specific set of operations. A role includes a set of rights and privileges. A user assumes that role inherits those rights and privileges.
ru: Роль — это сущность, которую пользователь принимает на себя для выполнения определенного набора операций. Роль включает в себя набор прав и привилегий. Пользователь предполагает, что роль наследует эти права и привилегии.

source: Add a line to include your newly created style sheet. For example, ``custom.css`` file:
ru: Добавьте строку, чтобы включить вашу недавно созданную таблицу стилей. Например, файл ``custom.css``:

source: Add a new project
ru: Добавить новый проект

source: Add a new user
ru: Добавить нового пользователя

source: Adjust the :guilabel:`Domain Name`, :guilabel:`User Name`, :guilabel:`Description`, :guilabel:`Email`, and :guilabel:`Primary Project`.
ru: Настройте :guilabel:`Доменное имя`, :guilabel:`Имя пользователя`, :guilabel:`Описание`, :guilabel:`Электронная почта` и :guilabel:`Основной проект`.

source: Administration Guide
ru: Руководство по администрированию

source: After architecting and implementing the core OpenStack services and other required services, combined with the Dashboard service steps below, users and administrators can use the OpenStack dashboard. Refer to the :doc:`OpenStack User Documentation </user/index>` chapter of the OpenStack End User Guide for further instructions on logging in to the Dashboard.
ru: После разработки архитектуры и внедрения основных служб OpenStack и других необходимых служб, а также выполнения описанных ниже шагов по работе с службами панели управления, пользователи и администраторы могут использовать панель управления OpenStack. Дополнительные инструкции по входу в панель см. в главе :doc:`OpenStack User Documentation </user/index>` руководства для пользователей OpenStack.

source: After configuring the ``local_settings.py`` file as shown, you can run the :command:`manage.py migrate` command to populate this newly created database.
ru: После настройки файла ``local_settings.py``, как показано на рисунке, вы можете выполнить команду :command:`manage.py migrate``, чтобы заполнить вновь созданную базу данных.

source: Allows easier import and migration of imported encrypted volumes, and allows access key to be changed without re-encrypting the volume
ru: Позволяет упростить импорт и миграцию импортированных зашифрованных дисков, а также позволяет изменять ключ доступа без повторного шифрования диска

source: As an administrative user, you can create and manage images for the projects to which you belong. You can also create and manage images for users in all projects to which you have access.
ru: В качестве администратора вы можете создавать и управлять образами для проектов, к которым вы принадлежите. Вы также можете создавать и управлять образами для пользователей во всех проектах, к которым у вас есть доступ.

source: As an administrative user, you can manage instances for users in various projects. You can view, terminate, edit, perform a soft or hard reboot, create a snapshot from, and migrate instances. You can also view the logs for instances or launch a VNC console for an instance.
ru: В качестве администратора вы можете управлять инстансами для пользователей различных проектов. Вы можете просматривать, завершать, изменять, выполнять мягкую или жесткую перезагрузку, создавать снимки и переносить инстансы. Вы также можете просматривать журналы инстансов или запускать VNC-консоль для инстанса.

source: As an administrative user, you can manage volumes and volume types for users in various projects. You can create and delete volume types, and you can view and delete volumes. Note that a volume can be encrypted by using the steps outlined below.
ru: В качестве администратора вы можете управлять дисками и типами дисков для пользователей в различных проектах. Вы можете создавать и удалять типы дисков, а также просматривать и удалять диски. Обратите внимание, что диск можно зашифровать, выполнив описанные ниже действия.

source: As an administrative user, you can view information for OpenStack services.
ru: В качестве администратора вы можете просматривать информацию о службах OpenStack.

source: As of Newton, there are no default flavors. The following table lists the default flavors for Mitaka and earlier.
ru: В Newton нет шаблонов конфигураций по умолчанию. В следующей таблице перечислены шаблоны конфигураций по умолчанию для Mitaka и более ранних версий.

source: Assign hosts to the aggregate using the :guilabel:`Manage Hosts within Aggregate` tab in the same dialog box.
ru: Назначьте узлы агрегату, используя вкладку :guilabel:`Управление узлами в рамках агрегации` в том же диалоговом окне.

source: Based on your selection, there is an :guilabel:`Image File` or :guilabel:`Image Location` field. You can include the location URL or browse for the image file on your file system and add it.
ru: В зависимости от выбранного вами параметра появится поле :guilabel:`Файл образа` или :guilabel:`Расположение образа`. Вы можете указать URL-адрес расположения или найти файл образа в вашей файловой системе и добавить его.

source: Block Storage
ru: Блочное хранилище

source: By default, the help URL points to https://docs.openstack.org. To change this, edit the following attribute in ``local_settings.py``:
ru: По умолчанию URL-адрес справочника указывает на https://docs.openstack.org. Чтобы изменить это, отредактируйте следующий атрибут в ``local_settings.py``:

source: Cached database
ru: Кэшированная база данных

source: Change the colors and image file names as appropriate. Ensure the relative directory paths are the same. The following example file shows you how to customize your CSS file:
ru: Измените цвета и имена файлов изображений соответствующим образом. Убедитесь, что относительные пути к каталогам одинаковы. Следующий пример файла показывает, как настроить файл CSS:

source: Choose the image source from the dropdown list. Your choices are :guilabel:`Image Location` and :guilabel:`Image File`.
ru: Выберите источник образа из выпадающего списка. Вы можете выбрать следующие варианты: :guilabel:`Расположение образа` и :guilabel:`Файл образа`.

source: Cipher
ru: Шифр

source: Click :guilabel:`Create Encryption` in the Actions column of the newly created volume type.
ru: Нажмите кнопку :guilabel:`Создать шифрование` в столбце Действия только что созданного типа диска.

source: Click :guilabel:`Create Flavor`.
ru: Нажмите :guilabel:`Создать шаблон конфигурации`.

source: Click :guilabel:`Create Host Aggregate`.
ru: Нажмите кнопку :guilabel:`Создать агрегат узла`.

source: Click :guilabel:`Create Image`, which opens the :guilabel:`Create An Image` window.
ru: Нажмите кнопку :guilabel:`Создать образ`, в результате чего откроется окно :guilabel:`Создать образ`.

source: Click :guilabel:`Create Image`.
ru: Нажмите кнопку :guilabel:`Создать образ`.

source: Click :guilabel:`Create Project`.
ru: Нажмите кнопку :guilabel:`Создать проект`.

source: Click :guilabel:`Create Snapshot`. The Dashboard shows the instance snapshot in the :guilabel:`Images` category.
ru: Нажмите :guilabel:`Создать снимок`. В панели управления снимок инстанса отображается в категории :guilabel:`Образы`.

source: Click :guilabel:`Create User`.
ru: Нажмите кнопку :guilabel:`Создать пользователя`.

source: Click :guilabel:`Create Volume Type Encryption`.
ru: Нажмите кнопку :guilabel:`Создать тип шифрования диска`.

source: Click :guilabel:`Create Volume Type` button to confirm your changes.
ru: Нажмите кнопку :guilabel:`Создать тип диска`, чтобы подтвердить изменения.

source: Click :guilabel:`Delete Flavors`.
ru: Нажмите :guilabel:`Удалить шаблоны конфигураций`.

source: Click :guilabel:`Delete Images`.
ru: Нажмите кнопку :guilabel:`Удалить образы`.

source: Click :guilabel:`Delete Volume Types` button.
ru: Нажмите кнопку :guilabel:`Удалить типы дисков`.

source: Click :guilabel:`Delete Volumes` button.
ru: Нажмите кнопку :guilabel:`Удалить диски`.

source: Click :guilabel:`Download CSV Summary` to download a CSV summary.
ru: Нажмите :guilabel:`Скачать сводку CSV`, чтобы загрузить сводку CSV.

source: Click :guilabel:`Edit Image`.
ru: Нажмите кнопку :guilabel:`Изменить образ`.

source: Click :guilabel:`Save`.
ru: Нажмите :guilabel:`Сохранить`.

source: Click on the :guilabel:`Delete Projects` push button.
ru: Нажмите на кнопку :guilabel:`Удалить проекты`.

source: Click on the :guilabel:`Delete Users` push button.
ru: Нажмите на кнопку :guilabel:`Удалить пользователей`.

source: Click on the :guilabel:`Identity` label on the left column, and click :guilabel:`Projects`.
ru: Нажмите на ярлык :guilabel:`Идентификация` в левой колонке и выберите :guilabel:`Проекты`.

source: Click on the :guilabel:`Identity` label on the left column, and click :guilabel:`Users`.
ru: Нажмите на ярлык :guilabel:`Идентификация` в левой колонке и выберите :guilabel:`Пользователи`.

source: Click the :guilabel:`Create Role` button to confirm your changes.
ru: Нажмите кнопку :guilabel:`Создать роль`, чтобы подтвердить изменения.

source: Click the :guilabel:`Create Role` button.
ru: Нажмите кнопку :guilabel:`Создать роль`.

source: Click the :guilabel:`Create User` push button.
ru: Нажмите кнопку :guilabel:`Создать пользователя`.

source: Click the :guilabel:`Edit` button.
ru: Нажмите кнопку :guilabel:`Изменить`.

source: Click the :guilabel:`Update Default Quotas` button.
ru: Нажмите кнопку :guilabel:`Обновить квоты по умолчанию`.

source: Click the :guilabel:`Update Role` button to confirm your changes.
ru: Нажмите кнопку :guilabel:`Обновить роль`, чтобы подтвердить изменения.

source: Click the :guilabel:`Volume Types` tab, and click :guilabel:`Create Volume Type` button. In the :guilabel:`Create Volume Type` window, enter a name for the volume type.
ru: Перейдите на вкладку :guilabel:`Типы дисков` и нажмите кнопку :guilabel:`Создать тип диска`. В окне :guilabel:`Создать тип диска` введите имя типа диска.

source: Click the :guilabel:`Volume Types` tab, select the volume type or types that you want to delete.
ru: Перейдите на вкладку :guilabel:`Типы дисков`, выберите тип или типы дисков, которые вы хотите удалить.

source: Click the :guilabel:`Volumes` tab, Select the volume or volumes that you want to delete.
ru: Перейдите на вкладку :guilabel:`Диски`, выберите диск или диски, которые вы хотите удалить.

source: Comments
ru: Комментарии

source: Compute
ru: Вычислительная

source: Configure the Dashboard
ru: Настройте панель управления

source: Configure the Dashboard for HTTP
ru: Настройте панель управления для HTTP

source: Configure the Dashboard for HTTPS
ru: Настройка панели управления для HTTPS

source: Configure the encrypted volume by setting the parameters below from available options (see table):
ru: Настройте зашифрованный диск, задав параметры, указанные ниже, из доступных вариантов (см. таблицу):

source: Configuring the Dashboard for HTTPS also requires enabling SSL for the noVNC proxy service. On the controller node, add the following additional options to the ``[DEFAULT]`` section of the ``/etc/nova/nova.conf`` file:
ru: Настройка панели мониторинга для HTTPS также требует включения SSL для прокси-службы noVNC. На узле контроллера добавьте следующие дополнительные параметры в раздел ``[DEFAULT]`` файла ``/etc/nova/nova.conf``:

source: Content bytes allowed for each injected file.
ru: Допустимое количество байтов содержимого для каждого загруженного файла.

source: Control Location
ru: Место управления

source: Control the state of an instance
ru: Управление состоянием инстанса

source: Create a CSS style sheet in ``/usr/share/openstack-dashboard/openstack_dashboard/static/dashboard/scss/``.
ru: Создайте таблицу стилей CSS в ``/usr/share/openstack-dashboard/openstack_dashboard/static/dashboard/scss/``.

source: Create a MySQL user for the newly created dash database that has full control of the database. Replace DASH\_DBPASS with a password for the new user.
ru: Создайте пользователя MySQL для вновь созданной базы данных dash, который будет иметь полный контроль над базой данных. Замените DASH\_DBPASS на пароль для нового пользователя.

source: Create a role
ru: Создание роли

source: Create a volume type
ru: Создайте тип диска

source: Create a volume type using the steps above for :ref:`create-a-volume-type`.
ru: Создайте тип диска, выполнив шаги, описанные выше для :ref:`create-a-volume-type`.

source: Create an encrypted volume type
ru: Создайте зашифрованный тип диска

source: Create and manage host aggregates
ru: Создание и управление агрегатами узлов

source: Create and manage images
ru: Создание и управление образами

source: Create and manage roles
ru: Создание и управление ролями

source: Create flavors
ru: Создание шаблонов конфигураций

source: Create images
ru: Создание образов

source: Create instance snapshots
ru: Создание снимков инстансов

source: Create two PNG logo files with transparent backgrounds using the following sizes:
ru: Создайте два файла логотипа PNG с прозрачным фоном, используя следующие размеры:

source: Customize and configure the Dashboard
ru: Настройка и конфигурирование панели управления

source: Customize the Dashboard
ru: Настройка панели управления

source: Database-backed sessions are scalable, persistent, and can be made high-concurrency and highly available.
ru: Сессии, основанные на базе данных, масштабируемы, постоянны, их можно сделать высокопараллельными и высокодоступными.

source: Defines the number of
ru: Определяет количество

source: Delete a new user
ru: Удалить нового пользователя

source: Delete a project
ru: Удалить проект

source: Delete a role
ru: Удалить роль

source: Delete flavors
ru: Удаление шаблонов конфигураций

source: Delete images
ru: Удаление образов

source: Delete volume types
ru: Удаление типов дисков

source: Delete volumes
ru: Удаление дисков

source: Depending on the current state of the instance, you can perform various actions on the instance. For example, pause, un-pause, suspend, resume, soft or hard reboot, or terminate (actions in red are dangerous).
ru: В зависимости от текущего состояния инстанса вы можете выполнять с ним различные действия. Например, приостановить, снять с паузы, приостановить, возобновить, мягко или жестко перезагрузить или завершить работу (действия, выделенные красным цветом, являются опасными).

source: Disk (in GB)
ru: Дисковое пространство (в ГБ)

source: Each node can have multiple aggregates and each aggregate can have multiple key-value pairs. You can assign the same key-value pair to multiple aggregates.
ru: Каждый узел может иметь несколько агрегатов, а каждый агрегат - несколько пар ключ-значение. Одну и ту же пару ключ-значение можно назначить нескольким агрегатам.

source: Edit a role
ru: Изменить роль

source: Edit the ``openstack-dashboard.conf`` file as shown in the **Example After**:
ru: Отредактируйте файл ``openstack-dashboard.conf``, как показано в **Примере после**:

source: Enable or disable a user
ru: Включить или отключить пользователя

source: Enable this hybrid setting by configuring both your database and cache, as discussed previously. Then, set the following value:
ru: Включите этот гибридный параметр, настроив базу данных и кэш, как обсуждалось ранее. Затем установите следующее значение:

source: Encryption parameters
ru: Параметры шифрования

source: Enter ``quit`` at the ``mysql>`` prompt to exit MySQL.
ru: Введите ``quit`` в приглашении ``mysql>``, чтобы выйти из MySQL.

source: Enter a :guilabel:`Domain Name`, the :guilabel:`Username`, and a :guilabel:`password` for the new user. Enter an email for the new user, and specify which :guilabel:`Primary Project` they belong to. Leave the :guilabel:`Domain ID` field set at *default*. You can also enter a decription for the new user.
ru: Введите :guilabel:`Доменное имя`, :guilabel:`Имя пользователя` и :guilabel:`пароль` для нового пользователя. Введите электронную почту для нового пользователя и укажите, к какому :guilabel:`основному проекту` он принадлежит. Оставьте поле :guilabel:`ID домена` установленным по *умолчанию*. Вы также можете ввести описание нового пользователя.

source: Enter a brief description of the image.
ru: Введите краткое описание образа.

source: Enter a name for the image.
ru: Введите имя для образа.

source: Enter the MySQL root user's password when prompted.
ru: Введите пароль root пользователя MySQL, когда появится запрос.

source: Enter the Project name and description. Leave the :guilabel:`Domain ID` field set at *default*.
ru: Введите название и описание проекта. Оставьте для поля :guilabel:`ID домена` значение *default*.

source: Enter the amount of RAM to use, in megabytes.
ru: Введите объем оперативной памяти для использования в мегабайтах.

source: Enter the amount of disk space in gigabytes to use for the ephemeral partition. If unspecified, the value is 0 by default.
ru: Введите объем дискового пространства в гигабайтах для использования временного раздела. Если не указано, значение по умолчанию равно 0.

source: Enter the amount of disk space in gigabytes to use for the root (/) partition.
ru: Введите объем дискового пространства в гигабайтах, который будет использоваться для корневого (/) раздела.

source: Enter the amount of swap space (in megabytes) to use. If unspecified, the default is 0.
ru: Введите объем swap диска (в мегабайтах) для использования. Если не указано, по умолчанию используется значение 0.

source: Enter the flavor name.
ru: Введите имя шаблона конфигурации.

source: Enter the number of virtual CPUs to use.
ru: Введите количество виртуальных процессоров для использования.

source: Ephemeral disks offer machine local disk storage linked to the lifecycle of a VM instance. When a VM is terminated, all data on the ephemeral disk is lost. Ephemeral disks are not included in any snapshots.
ru: Временные диски предлагают локальное дисковое хранилище машины, связанное с жизненным циклом инстанса виртуальной машины. Когда виртуальная машина завершает работу, все данные на временном диске теряются. Временные диски не включаются ни в какие снимки.

source: Flavor
ru: Шаблон конфигурации

source: For details about image creation, see the `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.
ru: Подробные сведения о создании образа см. в руководстве `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.

source: For information about supporting metadata keys, see the the Compute service documentation.
ru: Информацию о поддержке ключей метаданных см. в документации вычислительной службы.

source: For information about using the Dashboard to launch instances as an end user, see the :doc:`OpenStack End User Guide </user/launch-instances>`.
ru: Информацию об использовании панели управления для запуска инстансов в качестве пользователя см. в :doc:`OpenStack End User Guide </user/launch-instances>`.

source: For information on configuring HTTPS or HTTP, see :ref:`configure_dashboard`.
ru: Информацию о настройке HTTPS или HTTP см. в разделе :ref:`configure_dashboard`.

source: From the drop-down list in the Actions column, select the state.
ru: Из выпадающего списка в столбце "Действия" выберите состояние.

source: Gigabytes
ru: Гигабайты

source: HTML title
ru: HTML-заголовок

source: Help URL
ru: URL справочника

source: Host aggregates enable administrative users to assign key-value pairs to groups of machines.
ru: Агрегаты узлов позволяют административным пользователям назначать пары ключ-значение группам машин.
