Repository: pypi-data/pypi-mirror-378
Catalog: packages/horizon/horizon-25.5.1.tar.gz/horizon-25.5.1/doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: However, database-backed sessions are one of the slower session storages and incur a high overhead under heavy usage. Proper configuration of your database deployment can also be a substantial undertaking and is far beyond the scope of this documentation.
ru: Однако сеансы, основанные на базе данных, являются одним из самых медленных хранилищ сеансов и при интенсивном использовании несут большие накладные расходы. Правильная настройка развертывания базы данных также может стать серьезной задачей и выходит далеко за рамки данной документации.

source: If you try to access the Dashboard through HTTP, the browser redirects you to the HTTPS page.
ru: Если вы попытаетесь получить доступ к панели управления через HTTP, браузер перенаправит вас на страницу HTTPS.

source: If you use Django 1.4 or later, the ``signed_cookies`` back end avoids server load and scaling problems.
ru: Если вы используете Django 1.4 или более позднюю версию, то бекэнд ``signed_cookies` позволяет избежать проблем с нагрузкой на сервер и масштабированием.

source: In OpenStack, a flavor defines the compute, memory, and storage capacity of a virtual server, also known as an instance. As an administrative user, you can create and delete flavors and update their metadata.
ru: В OpenStack шаблон конфигурации определяет вычислительную мощность, память и емкость хранилища виртуального сервера, также известного как инстанс. Как административный пользователь, вы можете создавать и удалять шаблоны и обновлять их метаданные.

source: In the :guilabel:`Add/Remove Hosts to Aggregate` dialog box, click **+** to assign a host to an aggregate. Click **-** to remove a host that is assigned to an aggregate.
ru: В диалоговом окне :guilabel:`Добавление/удаление агрегата узлов` нажмите **+**, чтобы назначить узел агрегату. Нажмите **-**, чтобы удалить узел, назначенный агрегату.

source: In the :guilabel:`Admin` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Flavors` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Вычислительные ресурсы` и нажмите на категорию :guilabel:`Шаблоны конфигураций`.

source: In the :guilabel:`Confirm Delete Flavors` window, click :guilabel:`Delete Flavors` to confirm the deletion. You cannot undo this action.
ru: В окне :guilabel:`Подтверждение удаления шаблонов конфигураций` нажмите :guilabel:`Удалить шаблоны конфигураций`, чтобы подтвердить удаление. Отменить это действие нельзя.

source: In the :guilabel:`Confirm Delete Images` window, click :guilabel:`Delete Images` to confirm the deletion.
ru: В окне :guilabel:`Подтвердить удаление образов` нажмите :guilabel:`Удалить образы`, чтобы подтвердить удаление.

source: In the :guilabel:`Confirm Delete Roles` window, click :guilabel:`Delete Roles` to confirm the deletion.
ru: В окне :guilabel:`Подтвердить удаление ролей` нажмите :guilabel:`Удалить роли`, чтобы подтвердить удаление.

source: In the :guilabel:`Confirm Delete Volume Types` window, click the :guilabel:`Delete Volume Types` button to confirm the action.
ru: В окне :guilabel:`Подтвердить удаление типов дисков` нажмите кнопку :guilabel:`Удалить типы дисков`, чтобы подтвердить действие.

source: In the :guilabel:`Confirm Delete Volumes` window, click the :guilabel:`Delete Volumes` button to confirm the action.
ru: В окне :guilabel:`Подтвердить удаление дисков` нажмите кнопку :guilabel:`Удалить диски`, чтобы подтвердить действие.

source: In the :guilabel:`Create An Image` window, enter or select the following values:
ru: В окне :guilabel:`Создать образ` введите или выберите следующие значения:

source: In the :guilabel:`Create Flavor` window, enter or select the parameters for the flavor in the :guilabel:`Flavor Information` tab.
ru: В окне :guilabel:`Создать шаблон конфигурации` введите или выберите параметры типа на вкладке :guilabel:`Информация о шаблоне конфигурации`.

source: In the :guilabel:`Create Host Aggregate` dialog box, enter or select the following values on the :guilabel:`Host Aggregate Information` tab:
ru: В диалоговом окне :guilabel:`Создать агрегат узлов` введите или выберите следующие значения на вкладке :guilabel:`Информация об агрегате узлов`:

source: In the :guilabel:`Create Role` window, enter a name for the role.
ru: В окне :guilabel:`Создать роль` введите имя роли.

source: In the :guilabel:`Create Snapshot` window, enter a name for the snapshot.
ru: В окне :guilabel:`Создать снимок` введите имя снимка.

source: In the :guilabel:`Edit Host Aggregate` dialog box, you can change the name and availability zone for the aggregate.
ru: В диалоговом окне :guilabel:`Изменить агрегат узлов` можно изменить имя и зону доступности агрегата.

source: In the :guilabel:`Edit Image` window, you can change the image name.
ru: В окне :guilabel:`Изменить образ` можно изменить название образа.

source: In the :guilabel:`Flavor Access` tab, you can control access to the flavor by moving projects from the :guilabel:`All Projects` column to the :guilabel:`Selected Projects` column.
ru: На вкладке :guilabel:`Доступ к шаблону конфигурации` вы можете управлять доступом к шаблону конфигурации, перемещая проекты из столбца :guilabel:`Все проекты` в столбец :guilabel:`Выбранные проекты`.

source: In the :guilabel:`Update Default Quotas` window, you can edit the default quota values.
ru: В окне :guilabel:`Обновить параметры по умолчанию` вы можете изменить значения квот по умолчанию.

source: In the :guilabel:`Update Flavor Metadata` window, you can customize some metadata keys, then add it to this flavor and set them values.
ru: В окне :guilabel:`Обновить метаданные шаблона конфигурации` вы можете настроить некоторые ключи метаданных, а затем добавить их к этому шаблону конфигурации и задать им значения.

source: In the :guilabel:`Update Role` window, enter a new name for the role.
ru: В окне :guilabel:`Обновить роль` введите новое имя роли.

source: In the ``local_settings.py`` file, change these options:
ru: В файле ``local_settings.py`` измените эти параметры:

source: In the ``local_settings.py`` file, update the following options:
ru: В файле ``local_settings.py`` обновите следующие параметры:

source: In this configuration, the Apache HTTP Server listens on port 443 and redirects all non-secure requests to the HTTPS protocol. The secured section defines the private key, public key, and certificate to use.
ru: В этой конфигурации Apache HTTP Server прослушивает порт 443 и перенаправляет все небезопасные запросы на протокол HTTPS. Защищенный раздел определяет закрытый ключ, открытый ключ и сертификат для использования.

source: Initialize and configure the database
ru: Инициализируйте и настройте базу данных

source: Injected File Content Bytes
ru: Байты содержимого загруженного файла

source: Injected Files
ru: Загруженные файлы

source: Injected files allowed for each project.
ru: Загруженные файлы для каждого проекта.

source: Instance cores allowed for each project.
ru: Ядра инстансов, разрешенные для каждого проекта.

source: Instances
ru: Инстансы

source: Instances allowed for each project.
ru: Инстансы, разрешенные для каждого проекта.

source: Key Size (bits)
ru: Размер ключа (биты)

source: Key pairs
ru: Ключевые пары

source: Leave this field empty.
ru: Оставьте это поле пустым.

source: Less disk overhead than LUKS
ru: Меньше нагрузка на диск, чем у LUKS

source: Local memory cache
ru: Локальный кэш памяти

source: Local memory storage is the quickest and easiest session back end to set up, as it has no external dependencies whatsoever. It has the following significant drawbacks:
ru: Хранение в оперативной памяти - это самый быстрый и простой в настройке бекэнд сессии, поскольку он не имеет внешних зависимостей. У него есть следующие существенные недостатки:

source: Locate the User you would like to update, and select the :guilabel:`Edit` push button under the :guilabel:`Actions` column.
ru: Найдите пользователя, которого вы хотите обновить, и выберите кнопку :guilabel:`Изменить` под колонкой :guilabel:`Действия`.

source: Locate the User you would like to update, and select the arrow to the right of the :guilabel:`Edit` push button. This will open a drop down menu.
ru: Найдите пользователя, которого вы хотите обновить, и выберите стрелку справа от кнопки :guilabel:`Изменить`. Откроется выпадающее меню.

source: Locate the project you wish to update, and under the :guilabel:`Actions` column click on the drop down arrow next to the :guilabel:`Manage Members` push button. The :guilabel:`Update Project` window will open.
ru: Найдите проект, который вы хотите обновить, и в колонке :guilabel:`Действия` нажмите на выпадающую стрелку рядом с кнопкой :guilabel:`Управлять участниками`. Откроется окно :guilabel:`Обновить проект`.

source: Log in to the Dashboard and select the :guilabel:`admin` project from the drop-down list.
ru: Войдите в панель управления и выберите проект :guilabel:`admin` из раскрывающегося списка.

source: Log in to the dashboard and select the :guilabel:`Identity` project from the drop-down list.
ru: Войдите в панель управления и выберите проект :guilabel:`Identity` из раскрывающегося списка.

source: Log in to the dashboard and select the :guilabel:`admin` project from the drop-down list.
ru: Войдите в панель управления и выберите проект :guilabel:`admin` из раскрывающегося списка.

source: Log into the OpenStack Dashboard as the Admin user.
ru: Войдите в панель управления OpenStack как администратор.

source: Logged in banner: 216 x 35
ru: Баннер для авторизованных пользователей: 216 x 35

source: Login screen: 365 x 50
ru: Экран авторизации: 365 x 50

source: Logo
ru: Логотип

source: Logo and site colors
ru: Цвета логотипа и сайта

source: Logo link
ru: Ссылка на логотип

source: Manage flavors
ru: Управление шаблонами конфигураций

source: Manage instances
ru: Управление инстансами

source: Manage projects and users
ru: Управление проектами и пользователями

source: Manage volumes and volume types
ru: Управление дисками и типами дисков

source: Memcached is a high-performance and distributed memory object caching system providing in-memory key-value store for small chunks of arbitrary data.
ru: Memcached - это высокопроизводительная система кэширования объектов распределенной памяти, обеспечивающая хранение в памяти ключей-значений для небольших фрагментов произвольных данных.

source: Memcached service running and accessible.
ru: Служба Memcached запущена и доступна.

source: Metadata Items
ru: Элементы метаданных

source: Metadata items allowed for each instance.
ru: Элементы метаданных, допустимые для каждого инстанса.

source: No persistence after a process terminates.
ru: Не сохраняется после завершения процесса.

source: No shared storage across processes or workers.
ru: Никакого общего хранилища для процессов или worker'ов.

source: Note: On the command line, type 'cryptsetup benchmark' for additional options
ru: Примечание: в командной строке введите 'cryptsetup benchmark' для получения дополнительных опций

source: Number of key pairs.
ru: Количество ключевых пар.

source: On Ubuntu, restart the ``nova-api`` service to ensure that the API server can connect to the Dashboard without error.
ru: В Ubuntu перезапустите службу ``nova-api``, чтобы убедиться, что сервер API может подключаться к панели управления без ошибок.

source: On the :guilabel:`Admin tab`, open the :guilabel:`Compute` tab and click the :guilabel:`Images` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Вычислительные ресурсы` и выберите категорию :guilabel:`Образы`.

source: On the :guilabel:`Admin` tab, click the :guilabel:`Overview` category.
ru: На вкладке :guilabel:`Администратор` перейдите в категорию :guilabel:`Обзор`.

source: On the :guilabel:`Admin` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Host Aggregates` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Вычислительные ресурсы` и перейдите в категорию :guilabel:`Агрегаты узлов`.

source: On the :guilabel:`Admin` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Images` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Вычислительные ресурсы` и выберите категорию :guilabel:`Образы`.

source: On the :guilabel:`Admin` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Images` category. The images that you can administer for cloud users appear on this page.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Вычислительные ресурсы` и щелкните категорию :guilabel:`Образы`. На этой странице появятся образы, которые вы можете администрировать для пользователей облака.

source: On the :guilabel:`Admin` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Instances` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Вычислительные ресурсы` и выберите категорию :guilabel:`Инстансы`.

source: On the :guilabel:`Admin` tab, open the :guilabel:`System` tab and click the :guilabel:`Default Quotas` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Система` и выберите категорию :guilabel:`Квоты по умолчанию`.

source: On the :guilabel:`Admin` tab, open the :guilabel:`System` tab and click the :guilabel:`System Information` category.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Система` и выберите категорию :guilabel:`Сведения о системе`.

source: On the :guilabel:`Admin` tab, open the :guilabel:`Volume` tab.
ru: На вкладке :guilabel:`Администратор` откройте вкладку :guilabel:`Диск`.

source: On the :guilabel:`Identity` tab, click the :guilabel:`Roles` category.
ru: На вкладке :guilabel:`Идентификация` нажмите на категорию :guilabel:`Роли`.

source: On the compute nodes, ensure the ``nonvncproxy_base_url`` option points to a URL with an HTTPS scheme:
ru: На вычислительных узлах убедитесь, что параметр ``nonvncproxy_base_url`` указывает на URL-адрес со схемой HTTPS:

source: Once you have the Dashboard installed, you can customize the way it looks and feels to suit the needs of your environment, your project, or your business.
ru: После установки панели управления вы можете настроить ее внешний вид и функциональность в соответствии с потребностями вашего окружения, проекта или бизнеса.

source: Only projects in the :guilabel:`Selected Projects` column can use the flavor. If there are no projects in the right column, all projects can use the flavor.
ru: Только проекты в колонке :guilabel:`Выбранные проекты` могут использовать шаблон конфигурации. Если в правой колонке нет проектов, все проекты смогут использовать шаблон конфигурации.

source: Open the following HTML template in an editor of your choice:
ru: Откройте следующий HTML-шаблон в редакторе по вашему выбору:

source: OpenStack Identity service defines a user's role on a project, but it is completely up to the individual service to define what that role means. This is referred to as the service's policy. To get details about what the privileges for each role are, refer to the ``policy.json`` file available for each service in the ``/etc/SERVICE/policy.json`` file. For example, the policy defined for OpenStack Identity service is defined in the ``/etc/keystone/policy.json`` file.
ru: Служба идентификации OpenStack определяет роль пользователя в проекте, но определение значения этой роли полностью зависит от конкретной службы. Это называется политикой службы. Чтобы получить подробную информацию о привилегиях для каждой роли, обратитесь к файлу ``policy.json``, доступному для каждой службы в файле ``/etc/SERVICE/policy.json``. Например, политика, определенная для службы идентификации OpenStack, определена в файле ``/etc/keystone/policy.json``.

source: OpenStack administrators can create projects, and create accounts for new users using the OpenStack Dasboard. Projects own specific resources in your OpenStack environment. You can associate users with roles, projects, or both.
ru: Администраторы OpenStack могут создавать проекты и создавать учетные записи для новых пользователей с помощью панели управления OpenStack. Проекты владеют определенными ресурсами в вашем окружении OpenStack. Вы можете связать пользователей с ролями, проектами или и с теми, и с другими.

source: Parameter options
ru: Параметры опций

source: Provider
ru: Провайдер

source: Python module ``python-memcached`` installed.
ru: Python модуль ``python-memcached`` установлен.

source: Python modules ``redis`` and ``django-redis`` installed.
ru: Python модули ``redis`` и ``django-redis`` установлены.

source: Quota Name
ru: Имя квоты

source: RAM (MB)
ru: Оперативная память (МБ)

source: RAM (in MB)
ru: Оперативная память (в МБ)

source: RAM megabytes allowed for each instance.
ru: Допустимый объем оперативной памяти в мегабайтах для каждого инстанса.

source: Redis is an open source, BSD licensed, advanced key-value store. It is often referred to as a data structure server.
ru: Redis - это расширенное хранилище данных в формате ключ-значение с открытым исходным кодом и лицензией BSD. Его часто называют сервером структур данных.

source: Redis service running and accessible.
ru: Служба Redis запущена и доступна.

source: Requirements:
ru: Требования:

source: Restart Apache for this change to take effect.
ru: Перезапустите Apache, чтобы изменения вступили в силу.

source: Restart ``memcached``.
ru: Перезапустите ``memcached``.

source: Restart the Apache HTTP Server.
ru: Перезапустите HTTP-сервер Apache.

source: Restart the Apache service.
ru: Перезапустите службу Apache.

source: Security Group Rules
ru: Правила группы безопасности

source: Security Groups
ru: Группы безопасности

source: Security group rules allowed for each project.
ru: Правила группы безопасности, разрешенные для каждого проекта.

source: Security groups allowed for each project.
ru: Группы безопасности, разрешенные для каждого проекта.

source: See NIST reference below to see advantages*
ru: См. справочник NIST ниже для ознакомления с преимуществами*

source: See the Django `cookie-based sessions <https://docs.djangoproject.com/en/dev/topics/http/sessions/#using-cookie-based-sessions>`__ documentation.
ru: См. документацию по Django `cookie-based sessions <https://docs.djangoproject.com/en/dev/topics/http/sessions/#using-cookie-based-sessions>`__.

source: Select :guilabel:`Disable User`.
ru: Выберите :guilabel:`Отключить пользователя`.

source: Select a month and click :guilabel:`Submit` to query the instance usage for that month.
ru: Выберите месяц и нажмите :guilabel:`Запросить', чтобы запросить использование инстансов за этот месяц.

source: Select an instance to create a snapshot from it. From the Actions drop-down list, select :guilabel:`Create Snapshot`.
ru: Выберите инстанс, чтобы создать из него снимок. Из выпадающего списка в колонке "Действия" выберите :guilabel:`Создать снимок`.

source: Select the :guilabel:`Create Project` push button. The :guilabel:`Create Project` window will open.
ru: Выберите кнопку :guilabel:`Создать проект`. Откроется окно :guilabel:`Создать проект`.

source: Select the :guilabel:`Public` check box to make the image public. Clear this check box to make the image private. You cannot change the :guilabel:`Kernel ID`, :guilabel:`Ramdisk ID`, or :guilabel:`Architecture` attributes for an image.
ru: Установите флажок :guilabel:`Публичный`, чтобы сделать образ публичным. Снимите этот флажок, чтобы сделать образ частным. Вы не можете изменить атрибуты :guilabel:`ID ядра`, :guilabel:`Ramdisk ID` или :guilabel:`Архитектура` для образа.

source: Select the :guilabel:`admin` project from the drop-down list at the top of the page.
ru: Выберите проект :guilabel:`admin` из выпадающего списка в верхней части страницы.

source: Select the checkbox to the left of the project you would like to delete.
ru: Установите галочку слева от проекта, который вы хотите удалить.

source: Select the checkbox to the left of the user you would like to delete.
ru: Установите галочку слева от пользователя, которого вы хотите удалить.

source: Select the flavor that you want to update. In the drop-down list, click :guilabel:`Update Metadata` or click :guilabel:`No` or :guilabel:`Yes` in the :guilabel:`Metadata` column.
ru: Выберите шаблон конфигурации, который вы хотите обновить. В раскрывающемся списке нажмите :guilabel:`Обновить метаданные` или нажмите :guilabel:`Нет` или :guilabel:`Да` в столбце :guilabel:`Метаданные`.

source: Select the flavors that you want to delete.
ru: Выберите шаблоны конфигураций, которые вы хотите удалить.

source: Select the image format.
ru: Выберите формат образа.

source: Select the images that you want to delete.
ru: Выберите образы, которые нужно удалить.

source: Select the images that you want to edit. Click :guilabel:`Edit Image`.
ru: Выберите образы, которые вы хотите изменить. Нажмите :guilabel:`Изменить образ`.

source: Select the instance for which you want to change the state.
ru: Выберите инстанс, для которого нужно изменить состояние.

source: Select the role you want to delete and click the :guilabel:`Delete Roles` button.
ru: Выберите роль, которую вы хотите удалить, и нажмите кнопку :guilabel:`Удалить роли`.

source: Select this option to ensure that only users with permissions can delete it.
ru: Выберите этот параметр, чтобы удалить его могли только пользователи с соответствующими правами.

source: Select this option to make the image public to all users.
ru: Выберите этот параметр, чтобы сделать образ общедоступным для всех пользователей.

source: Service
ru: Служба

source: Set the HTML title, which appears at the top of the browser window, by adding the following line to ``local_settings.py``:
ru: Задайте HTML-заголовок, который отображается в верхней части окна браузера, добавив следующую строку в ``local_settings.py``:

source: Set up session storage for the Dashboard
ru: Настройка хранения сеансов для панели управления

source: Site colors
ru: Цвета сайта

source: Snapshots
ru: Снимки

source: Specifies the encryption algorithm.
ru: Указание алгоритма шифрования.

source: Specifies the encryption key size.
ru: Указывает размер ключа шифрования.

source: Specifies the encryption provider format.
ru: Указывает формат поставщика шифрования.

source: Specifies whether the encryption is from the front end (nova) or the back end (cinder).
ru: Указывает, где выполняется шифрование - фронтендом (nova) или бекэндом (cinder) конце.

source: Specify the architecture. For example, ``i386`` for a 32-bit architecture or ``x86_64`` for a 64-bit architecture.
ru: Укажите архитектуру. Например, ``i386`` для 32-битной архитектуры или ``x86_64`` для 64-битной архитектуры.

source: Specify the host for your Identity service endpoint in the ``local_settings.py`` file with the ``OPENSTACK_HOST`` setting.
ru: Укажите хост для точки доступа службы идентификации в файле ``local_settings.py`` с помощью параметра ``OPENSTACK_HOST``.

source: Specify this option to copy image data to the Image service.
ru: Укажите этот параметр для копирования данных образов в службу образов.

source: Start the MySQL command-line client.
ru: Запустите клиент MySQL из командной строки.

source: The Dashboard uses `Django sessions framework <https://docs.djangoproject.com/en/dev/topics/http/sessions/>`__ to handle user session data. However, you can use any available session back end. You customize the session back end through the ``SESSION_ENGINE`` setting in your ``local_settings.py`` file.
ru: Панель управления использует фреймворк сессий Django <https://docs.djangoproject.com/en/dev/topics/http/sessions/>`__ для обработки данных пользовательских сессий. Однако вы можете использовать любой доступный бэк-энд сессий. Вы настраиваете бекэнд сессии с помощью параметра ``SESSION_ENGINE`` в вашем файле ``local_settings.py``.
