Repository: pypi-data/pypi-mirror-378
Catalog: packages/horizon/horizon-25.5.1.tar.gz/horizon-25.5.1/doc/source/locale/*/LC_MESSAGES/doc.po
Languages: ru

source: Contributor Docs
ru: Документация для разработчиков

source: For a more in-depth look at Horizon and its architecture, see the :ref:`contributor-intro`.
ru: Для более подробного ознакомления с Horizon и его архитектурой см. :ref:`contributor-intro`.

source: For those wishing to develop Horizon itself, or go in-depth with building your own :class:`~horizon.Dashboard` or :class:`~horizon.Panel` classes, the following documentation is provided.
ru: Для тех, кто хочет разрабатывать Horizon самостоятельно или углубляться в создание собственных классов :class:`~horizon.Dashboard` или :class:`~horizon.Panel`, предоставляется следующая документация.

source: Horizon is the canonical implementation of `OpenStack's Dashboard <https://opendev.org/openstack/horizon>`_, which provides a web based user interface to OpenStack services including Nova, Swift, Keystone, etc.
ru: Horizon — это реализация `панели управления OpenStack <https://opendev.org/openstack/horizon>`_, которая предоставляет пользовательский веб-интерфейс для сервисов OpenStack, включая Nova, Swift, Keystone и т. д.

source: Horizon: The OpenStack Dashboard Project
ru: Horizon: проект панели управления OpenStack

source: How to use Horizon in your own projects.
ru: Как использовать Horizon в ваших проектах.

source: Information
ru: Информация

source: Introduction
ru: Введение

source: Release Notes
ru: Список изменений

source: See https://docs.openstack.org/releasenotes/horizon/.
ru: См. https://docs.openstack.org/releasenotes/horizon/.

source: To learn what you need to know to get going, see the :ref:`quickstart`.
ru: Чтобы понять, что вам нужно знать для начала работы, см. :ref:`quickstart`.

source: User Documentation
ru: Документация для пользователей

source: Using Horizon
ru: Использование Horizon
