{
    "model_type": "fukui_net",
    "atom_in_features": 133,
    "edge_attr_dim": 14,
    "hidden_dim": 128,
    "kan_grid_size": 5,
    "kan_spline_order": 3,
    "cheb_k": 3,
    "num_layers": 3,
    "dropout": 0.1,
    "architectures": ["FukuiNetForMolecularProperty"],
    "auto_map": {
        "AutoConfig": "hf_integration.FukuiNetConfig",
        "AutoModel": "hf_integration.FukuiNetForMolecularProperty"
    },
    "transformers_version": "4.45.0"
}
