Repository: pypi-data/pypi-mirror-378
Catalog: packages/hastexo-xblock/hastexo_xblock-8.5.1.tar.gz/hastexo_xblock-8.5.1/hastexo/translations/*/LC_MESSAGES/text.po
Languages: el, es_419, et_ee, hi

source: Timeout when launching stack.
el: Λήξη χρόνου εκκίνησης.
es_419: Tiempo de espera al iniciar la pila.
et_ee: Keskkonna loomiseks seatud ajalimiit täis.
hi: स्टैक लॉन्च करते समय टाइमआउट।

source: Unexpected result:
el: Απρόσμενο αποτέλεσμα:
es_419: Resultado inesperado:
et_ee: Ootamatu tulemus:
hi: अनपेक्षित परिणाम:

source: Timeout when checking progress.
el: Λήξη χρόνου κατά τον έλεγχο της προόδου.
es_419: Tiempo de espera al comprobar el progreso.
et_ee: Tulemuste kontrollimiseks seatud ajalimiit täis.
hi: प्रगति की जाँच करते समय समयबाह्य।

source: Please wait
el: Παρακαλώ περιμένετε
es_419: Por favor espere
et_ee: Palun oota
hi: कृपया प्रतीक्षा करें

source: We're preparing your lab environment.
el: Ετοιμάζουμε το εργαστηριακό σας περιβάλλον.
es_419: Estamos preparando su entorno de laboratorio
et_ee: Valmistame sinu laborikeskkonda.
hi: हम आपका प्रयोगशाला वातावरण तैयार कर रहे हैं।

source: Don't panic! It may take a few minutes.
el: Μήν ανησυχείτε, ίσως χρειαστούν μερικά λεπτά.

source: Sorry!
el: Συγνώμη!
es_419: ¡Lo siento!
et_ee: Vabandust!
hi: माफ़ करना!

source: Working
el: Επεξεργασία
es_419: Trabajando
et_ee: Töö käib
hi: कार्यरत

source: Progress check result
el: Αποτέλεσμα ελέγχου προόδου
es_419: Resultado de la comprobación de progreso
et_ee: Kontrollitud tulemus
hi: प्रगति जांच परिणाम

source: Hints
el: Υποδείξεις
es_419: Consejos
et_ee: Vihjed
hi: संकेत

source: There was a problem checking your progress:
el: Εμφανίστηκε πρόβλημα κατά τον έλεγχο της προόδου:
es_419: Hubo un problema al verificar tu progreso:
et_ee: Tulemuste kontolli käigus esines tõrge:
hi: आपकी प्रगति की जाँच करने में समस्या हुई:

source: We think you're busy elsewhere.
el: Πιθανώς ασχολείστε με κάτι άλλο.
es_419: Creemos que estás ocupado en otra parte.
et_ee: Arvame, et oled mujal hõivatud.
hi: हमें लगता है कि आप कहीं और व्यस्त हैं।

source: You've been inactive here for a while, so we paused your lab environment.
el: Είστε αδρανής για αρκετό χρόνο, επομένως αδρανοποιήσαμε το εργαστηριακό σας περιβάλλον.
es_419: Ha estado inactivo aquí durante un tiempo, por lo que detuvimos su entorno de laboratorio.
et_ee: Oled siin juba mõnda aega mitteaktiivne olnud seetõttu peatasime sinu laborikeskkonna.
hi: आप यहां कुछ समय से निष्क्रिय हैं, इसलिए हमने आपके प्रयोगशाला परिवेश को रोक दिया है।

source: Click 'OK' to return to your terminal in this window.
el: Κάντε κλικ στο 'OK' ώστε να επιστρέψετε στο τερματικό σας σ' αυτό το παράθυρο.
es_419: Haga clic en 'OK' para reanudarlo en esta ventana.
et_ee: Vajuta 'OK', et naaseda oma laborikeskkonda selles aknas.
hi: इस विंडो में अपने टर्मिनल पर लौटने के लिए 'ओके' पर क्लिक करें।

source: Are you sure?
el: Σίγουρα;
es_419: ¿Estás seguro?
et_ee: Kas oled kindel?
hi: क्या आपको यकीन है?

source: Resetting will return your lab environment to a pristine state.
el: Η επαναφορά θα φέρει το εργαστηριακό περιβάλλον στην αρχική του κατάσταση.
es_419: El reinicio devolverá el entorno de su laboratorio a un estado impecable.
et_ee: Taastamine viib sinu laborikeskkonna tagasi algsesse seisu.
hi: रीसेट करने से आपका लैब वातावरण एक पुरानी स्थिति में वापस आ जाएगा।

source: This may take several minutes to complete.
el: Αυτό ίσως χρειαστεί αρκετά λεπτά για να ολοκληρωθεί.
es_419: Esto puede tardar varios minutos en completarse.
et_ee: See võib mõni minut aega võtta.
hi: इसे पूरा होने में कई मिनट लग सकते हैं।

source: In a timed exam, the timer will continue to run while your environment is being reset.
el: Σε μια εξέταση που χρονομετράται, ο μετρητής θα συνεχίζει ακόμη και κατά τη διάρκεια επαναφοράς του περιβάλλοντος.
es_419: En un examen cronometrado, el cronómetro seguirá funcionando mientras se restablece su entorno.
et_ee: Ajastatud eksami käigus, taimer töötab keskkonna taastamise ajal edasi.
hi: एक समयबद्ध परीक्षा में, टाइमर तब तक चलता रहेगा जब तक कि आपका वातावरण रीसेट किया जा रहा है।

source: After you reset, you will need to retrace your steps up to this point.
el: Μετά την επαναφορά, θα χρειαστεί να επαναλάβετε όλα τα βήματα έως αυτό το σημείο.
es_419: Después de reiniciar, deberá volver sobre sus pasos hasta este punto.
et_ee: Peale taastamist pead kõik oma senised sammud kuni praeguseni uuesti läbima.
hi: आपके द्वारा रीसेट करने के बाद, आपको इस बिंदु तक अपने कदमों को पुनः प्राप्त करने की आवश्यकता होगी।

source: You cannot undo this action.
el: Δεν μπορείτε να ακυρώσετε αυτή την ενέργεια.
es_419: No puede deshacer esta acción.
et_ee: Seda toimingut ei saa tagasi võtta.
hi: आप इस क्रिया को पूर्ववत नहीं कर सकते।

source: You've reached the time limit allocated to you for using labs.
el: Εξαντλήσατε το χρόνο που έχει οριστεί για τη χρήση εργαστηρίων.
es_419: Ha alcanzado el límite de tiempo que se le ha asignado para usar los laboratorios.
et_ee: Oled jõudnud sinule laborite kasutamiseks määratud ajalimiidini.
hi: आप प्रयोगशालाओं का उपयोग करने के लिए आपको आवंटित समय सीमा तक पहुँच चुके हैं।

source: Could not connect to your lab environment. The client detected an unexpected error. The server's error message was:
el: Αδυναμία σύνδεσης στο εργαστηριακό σας περιβάλλον. Ο πελάτης συνάντησε ένα απρόσμενο σφάλμα. Το μήνυμα λάθους του διακομιστή, ήταν:
es_419: No se pudo conectar a su entorno de laboratorio. El cliente detectó un error inesperado. El mensaje de error del servidor fue:
et_ee: Laborikeskkonnaga ei õnnestunud ühendust luua. Klient tuvastas ootamatu vea. Serveri veateade oli:
hi: सर्वर का त्रुटि संदेश था:

source: Lost connection to your lab environment.
el: Χάθηκε η σύνδεση στο εργαστηριακό σας περιβάλλον.
es_419: Pérdida de conexión con su entorno de laboratorio.
et_ee: Ühendus sinu laborikeskkonnaga katkes.
hi: आपके प्रयोगशाला वातावरण से संबंध टूट गया।

source: The remote server unexpectedly disconnected. You can try closing your browser window, and returning to this page in a few minutes.
el: Ο απομακρυσμένος διακομιστής διέκοψε απρόσμενα. Δοκιμάστε να κλείσετε το παράθυρο του προγράμματος περιήγησης και επιστρέψτε σε αυτή τη σελίδα σε μερικά λεπτά.
es_419: El servidor remoto se desconectó inesperadamente. Puede intentar cerrar la ventana de su navegador y regresar a esta página en unos minutos.
et_ee: Kaugserver katkestas ootamatult ühenduse. Võite proovida brauseriakna sulgeda ja mõne minuti pärast sellele lehele naasta.
hi: दूरस्थ सर्वर अनपेक्षित रूप से डिस्कनेक्ट हो गया. आप अपनी ब्राउज़र विंडो' को बंद करने और कुछ ही मिनटों में इस पृष्ठ पर लौटने का प्रयास कर सकते हैं।

source: Your lab is currently active in a separate window.
el: Αυτή τη στιγμή το εργαστήριό σας είναι ενεργό σε ξεχωριστό παράθυρο.
es_419: Su laboratorio está actualmente activo en una ventana separada.
et_ee: Sinu laborikeskkond on hetkel aktiivne teises aknas.
hi: आपकी प्रयोगशाला वर्तमान में एक अलग विंडो में सक्रिय है।

source: Attention!
el: Προσοχή!
es_419: ¡Atención!
et_ee: Tähelepanu!
hi: ध्यान!

source: Could not connect to your lab environment:
el: Αδυνατώ να συνδεθώ στο περιβάλλον του εργαστηρίου σας:
es_419: No se pudo conectar al entorno de su laboratorio.
et_ee: Laborikeskkonnaga ei ōnnestunud ühendust luua.
hi: आपके प्रयोगशाला परिवेश से कनेक्ट नहीं हो सका:

source: Your lab environment is undergoing maintenance
el: Το εργαστηριακό σας περιβάλλον είναι υπό συντήρηση
es_419: Su entorno de laboratorio está en mantenimiento
et_ee: Teie laborikeskkond on hetkel hoolduses
hi: आपके प्रयोगशाला वातावरण का रखरखाव किया जा रहा है

source: Your lab environment is undergoing automatic maintenance. Please try again in a few minutes.
el: Το εργαστηριακό σας περιβάλλον τελεί υπό αυτοματοποιημένη συντήρηση. Παρακαλούμε προσπαθήστε ξανά σε μερικά λεπτά.
es_419: Su entorno de laboratorio está en mantenimiento automático. Vuelve a intentarlo en unos minutos.
et_ee: Teie laborikeskkond on hetkel automaatsel hooldusel. Palun proovi mõne minuti pärast uuesti.
hi: आपका प्रयोगशाला वातावरण स्वचालित रखरखाव के दौर से गुजर रहा है। कृपया पुन: प्रयास करें कुछ मिनटों में।

source: There was a problem preparing your lab environment:
el: Παρουσιάστηκε πρόβλημα κατά την προετοιμασία του εργαστηριακού σας περιβάλλοντος:
es_419: Hubo un problema al preparar su entorno de laboratorio:
et_ee: Sinu laborikeskkonna ettevalmistamisel esines tõrge:
hi: आपकी प्रयोगशाला के वातावरण को तैयार करने में कोई समस्या थी:

source: You completed {passed} out of {total} tasks.
el: Ολοκληρώσατε {passed} από {total} εργασίες.
es_419: Has completado {passed} de {total} tareas.
et_ee: Läbisid edukalt {passed} ülesannet {total}-st.
hi: आपने {passed} कार्यों में से {total} कर लिए हैं।

source: Don't panic! It may take a few minutes.
es_419: ¡No entrar en pánico! Puede tomar unos minutos.
et_ee: Ole mureta! Siin võib mõni minut aega minna.
hi: घबड़ाएं नहीं! इसमें कुछ मिनट लग सकते हैं।
