Repository: pypi-data/pypi-mirror-378
Catalog: packages/trytoncommunity-web-shop-woocommerce/trytoncommunity_web_shop_woocommerce-7.0.4-py3-none-any.whl/trytond/modules/web_shop_woocommerce/locale/*.po
Languages: ca

# field:product.category,woocommerce_tax_class:
source: WooCommerce Tax Class
ca: Classe Impost WooCommerce

# field:web.shop,price_list:
source: Price List
ca: Tarifa

# field:web.shop,shipping_product:
source: Shipping Product
ca: Producte transport

# field:web.shop,woocommerce_consumer_key:
source: WooCommerce Consumer Key
ca: Clau consumidor WooCommerce

# field:web.shop,woocommerce_consumer_secret:
source: WooCommerce Consumer Secret
ca: Secret consumidor WooCommerce

# field:web.shop,woocommerce_url:
source: WooCommerce URL
ca: URL WooCommerce

# field:web.shop.woocommerce_id,record:
source: Record
ca: Registre

# field:web.shop.woocommerce_id,shop:
source: Web Shop
ca: Tenda Web

# field:web.shop.woocommerce_id,woocommerce_id:
source: WooCommerce ID
ca: ID WooCommerce

# model:ir.message,text:msg_id_record_unique
source: The WooCommerce ID must be unique for each record and shop.
ca: El ID de WooCommerce ha de ser únic per cada registre i tenda.

# model:ir.message,text:msg_missing_parents_error
source: In order to sincronize "%(records)s" you must also sincronize it's parent records.
ca: Per sincronitzar els registres "%(records)s" heu de sincronitzar també els seus registres pare.

# model:ir.message,text:msg_missing_shipping_product
source: It is not possible to import orders because shop "%(shop)s" does not have any shipping product.
ca: No es pot importar les comandes de la tenda "%(shop)s" perquè no té un producte per al transport.

# model:ir.message,text:msg_sincronization_error
source: Error while sincronizing woocommerce records: "%(response)s".
ca: Error al sincronizar els registres de woocommernce: %(response)s".

# model:ir.message,text:msg_woocommerce_id
source: WooCoomerce ID
ca: ID WooCommerce

# model:web.shop.woocommerce_id,name:
source: Web Shop WooCommerce ID
ca: Tenda Web WooCommerce ID

# selection:ir.cron,method:
source: Download WooCommerce Orders
ca: Baixa comandes WooCommerce

# selection:ir.cron,method:
source: Update WooCommerce Products
ca: Actualitza productes WooCoommerce
